#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/unisorter/fileshare-infra/runs/run-shkyyD93Eqi8E5wb

Waiting for the plan to start...

Terraform v1.0.1
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.api_presigned_upload_url.module.lambda_function.module.lambda_function.local_file.archive_plan[0]: Refreshing state... [id=e1e9b21fa5078b189ed4af50922fc871894faa51]
module.api_presigned_upload_url.module.lambda_function.module.lambda_function.null_resource.archive[0]: Refreshing state... [id=5696587128926097790]
module.s3.module.log_bucket.aws_s3_bucket.this[0]: Refreshing state... [id=unisorter-file-share-logs]
module.api_presigned_upload_url.aws_cloudwatch_log_group.logs: Refreshing state... [id=/aws/api-gaeway/presigned-upload-url]
module.api_presigned_upload_url.module.api_gateway.aws_apigatewayv2_api.this[0]: Refreshing state... [id=k7a97fikq5]
module.api_presigned_upload_url.module.lambda_function.module.lambda_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/presigned-upload-url]
module.api_presigned_upload_url.module.lambda_function.module.lambda_function.aws_iam_role.lambda[0]: Refreshing state... [id=presigned-upload-url]
module.api_presigned_upload_url.module.api_gateway.aws_apigatewayv2_stage.default[0]: Refreshing state... [id=$default]
module.api_presigned_upload_url.module.lambda_function.module.lambda_function.aws_lambda_function.this[0]: Refreshing state... [id=presigned-upload-url]
module.api_presigned_upload_url.module.lambda_function.module.lambda_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::797849036607:policy/presigned-upload-url-logs]
module.api_presigned_upload_url.module.lambda_function.module.lambda_function.aws_iam_policy_attachment.logs[0]: Refreshing state... [id=presigned-upload-url-logs]
module.api_presigned_upload_url.module.api_gateway.aws_apigatewayv2_integration.this["GET /api/file-share/upload"]: Refreshing state... [id=tmhlmzm]
module.api_presigned_upload_url.module.lambda_function.module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromAPIGateway"]: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api_presigned_upload_url.module.api_gateway.aws_apigatewayv2_route.this["GET /api/file-share/upload"]: Refreshing state... [id=sosbbgq]
module.s3.module.log_bucket.aws_s3_bucket_policy.this[0]: Refreshing state... [id=unisorter-file-share-logs]
module.s3.module.log_bucket.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=unisorter-file-share-logs]
module.s3.module.s3_bucket.aws_s3_bucket.this[0]: Refreshing state... [id=unisorter-file-share]
module.s3.module.s3_bucket.aws_s3_bucket_policy.this[0]: Refreshing state... [id=unisorter-file-share]
module.s3.module.s3_bucket.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=unisorter-file-share]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.api_presigned_upload_url.module.api_gateway.aws_apigatewayv2_stage.default[0] has been changed
  ~ resource "aws_apigatewayv2_stage" "default" {
      + deployment_id   = "6161kl"
        id              = "$default"
        name            = "$default"
      + stage_variables = {}
        tags            = {
            "Stack" = "Unisorter"
        }
        # (6 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }
  # module.api_presigned_upload_url.module.api_gateway.aws_apigatewayv2_api.this[0] has been changed
  ~ resource "aws_apigatewayv2_api" "this" {
        id                           = "k7a97fikq5"
        name                         = "presigned-upload-url-http-api"
        tags                         = {
            "Stack" = "Unisorter"
        }
        # (9 unchanged attributes hidden)

      ~ cors_configuration {
          + expose_headers    = []
            # (5 unchanged attributes hidden)
        }
    }
  # module.api_presigned_upload_url.module.api_gateway.aws_apigatewayv2_integration.this["GET /api/file-share/upload"] has been changed
  ~ resource "aws_apigatewayv2_integration" "this" {
        id                     = "tmhlmzm"
      + request_parameters     = {}
      + request_templates      = {}
        # (7 unchanged attributes hidden)
    }
  # module.api_presigned_upload_url.module.api_gateway.aws_apigatewayv2_route.this["GET /api/file-share/upload"] has been changed
  ~ resource "aws_apigatewayv2_route" "this" {
      + authorization_scopes = []
        id                   = "sosbbgq"
      + request_models       = {}
        # (5 unchanged attributes hidden)
    }
  # module.api_presigned_upload_url.module.lambda_function.module.lambda_function.aws_lambda_function.this[0] has been changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "presigned-upload-url"
      ~ last_modified                  = "2021-06-28T03:30:16.865+0000" -> "2021-06-28T03:30:27.047+0000"
      + layers                         = []
        tags                           = {
            "Stack" = "Unisorter"
        }
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }
  # module.api_presigned_upload_url.module.lambda_function.module.lambda_function.aws_iam_role.lambda[0] has been changed
  ~ resource "aws_iam_role" "lambda" {
        id                    = "presigned-upload-url"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::797849036607:policy/presigned-upload-url-logs",
        ]
        name                  = "presigned-upload-url"
        tags                  = {
            "Stack" = "Unisorter"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.api_presigned_upload_url.module.lambda_function.module.lambda_function.aws_iam_policy_attachment.logs[0] has been changed
  ~ resource "aws_iam_policy_attachment" "logs" {
      + groups     = []
        id         = "presigned-upload-url-logs"
        name       = "presigned-upload-url-logs"
      + users      = []
        # (2 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.api_presigned_upload_url.module.lambda_function.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "presigned-upload-url"
      ~ publish                        = false -> true
      ~ qualified_arn                  = "arn:aws:lambda:ap-southeast-2:797849036607:function:presigned-upload-url:$LATEST" -> (known after apply)
        tags                           = {
            "Stack" = "Unisorter"
        }
      ~ version                        = "$LATEST" -> (known after apply)
        # (17 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.api_presigned_upload_url.module.lambda_function.module.lambda_function.aws_lambda_permission.current_version_triggers["AllowExecutionFromAPIGateway"] will be created
  + resource "aws_lambda_permission" "current_version_triggers" {
      + action        = "lambda:InvokeFunction"
      + function_name = "presigned-upload-url"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + qualifier     = (known after apply)
      + source_arn    = "arn:aws:execute-api:ap-southeast-2:797849036607:k7a97fikq5/*/*"
      + statement_id  = "AllowExecutionFromAPIGateway"
    }

  # module.api_presigned_upload_url.module.lambda_function.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5696587128926097790" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1624850950916224000" -> "1624851645291469000"
            # (1 unchanged element hidden)
        }
    }

Plan: 2 to add, 1 to change, 1 to destroy.


```

</details>

*Pusher: @umangm99, Action: `pull_request`*